// ----------------------------------------------------------------------------
// using
// ----------------------------------------------------------------------------
using ARu.Control.ChangeTheme;
using ARu.Control.License;

// ----------------------------------------------------------------------------
// namespace
// ----------------------------------------------------------------------------
namespace ARuMauiSample;

// ----------------------------------------------------------------------------
// class
// ----------------------------------------------------------------------------

/// <summary>
/// アプリケーション
/// </summary>
public partial class App : Application
{
    // ----------------------------------------------------------------------------
    // constructor
    // ----------------------------------------------------------------------------

    /// <summary>
    /// コンストラクタ
    /// </summary>
    public App()
	{
		InitializeComponent();

        // テーマ初期化
		ChangeTheme.InitializeTheme();

        // ページ登録
		SetRouting();

        // Shell生成
		MainPage = new AppShell();
	}

    // ----------------------------------------------------------------------------
    // method
    // ----------------------------------------------------------------------------

    /// <summary>
    /// ページ登録
    /// </summary>
    private void SetRouting()
    {
        Routing.RegisterRoute(LicenseDetailPage.PAGENAME, typeof(LicenseDetailPage));
    }
}
